RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_centroid.c
/***************************************************************************//**
* \file cy_capsense_centroid.c
* \version 3.0
*
* \brief
* This file provides the source code for the centroid calculation methods
* of the CAPSENSE&trade; middleware.
*
********************************************************************************
* \copyright
* Copyright 2018-2021, Cypress Semiconductor Corporation (an Infineon company)
* or an affiliate of Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include <string.h>
#include <stddef.h>
#include <stdint.h>
#include "cy_syslib.h"
#include "cy_capsense_centroid.h"
#include "cy_capsense_common.h"
#include "cy_capsense_lib.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_filter.h"
#include "cycfg_capsense_defines.h"

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3))
#if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_SLIDER_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_TOUCHPAD_EN))


/*******************************************************************************
* Local definition
*******************************************************************************/
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_LENGTH        (3u)
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_PREVIOUS      (0u)
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_CENTER        (1u)
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_NEXT          (2u)
#define CY_CAPSENSE_LINEAR_SLIDER_MIN_SNS_COUNT         (3u)
#define CY_CAPSENSE_TOUCHPAD_MIN_COL_SNS_COUNT          (3u)
#define CY_CAPSENSE_TOUCHPAD_MIN_ROW_SNS_COUNT          (3u)

/* Minimum valid age */
#define CY_CAPSENSE_CSX_TOUCHPAD_AGE_START              (0x0100u)
#define CY_CAPSENSE_CSX_TOUCHPAD_Z_SHIFT                (0x04u)
#define CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT             (8u)
#define CY_CAPSENSE_CENTROID_ROUND_VALUE                (0x7Fu)
#define CY_CAPSENSE_NO_LOCAL_MAX                        (0xFFFFu)

/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/
#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    static void Cy_CapSense_TransferTouch(
                    uint32_t newIndex,
                    uint32_t oldIndex,
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    static void Cy_CapSense_NewTouch(
                    uint32_t newIndex,
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    static uint32_t Cy_CapSense_CalcDistance(
                    uint32_t newIndex,
                    uint32_t oldIndex,
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    static void Cy_CapSense_Hungarian(
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    static void Cy_CapSense_CopyTouchRecord(
                    cy_stc_capsense_position_t * destination,
                    const cy_stc_capsense_position_t * source);
#endif
#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    __STATIC_INLINE void Cy_CapSense_TouchDownDebounce(
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    __STATIC_INLINE void Cy_CapSense_SortByAge(
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    __STATIC_INLINE uint8_t Cy_CapSense_GetLowestId(uint8_t idMask);
#endif
/** \} \endcond */


#if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_DIPLEX_SLIDER_EN) ||\
    (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_DIPLEX_SLIDER_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_DpCentroidDiplex
****************************************************************************//**
*
* Finds touch position of a Linear slider widget with enabled diplexing.
*
* In scope of position searching this function finds the local maximum with the
* highest raw count. If such maximums are more than one, then the maximum with the
* bigger sum of neighboring sensors is taken for further processing. Then the position
* is calculated using centroid algorithm with three sensors.
*
* At least two neighboring sensors should cross finger threshold. Then the algorithm 
* is able to distinguish where real touch is located (direct part of slider or
* diplex part of slider) and corresponding position is reported. Otherwise no 
* touch is reported.
*
* This function does not detect two or more touches.
* 
* \param newTouch
* The pointer to the touch structure where found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpCentroidDiplex(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t sum;
    uint32_t diffM;
    uint32_t diffP;
    uint32_t snsIndex;
    const cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    const uint8_t * ptrDpxTable;
    uint32_t snsCount = ptrWdConfig->numSns;
    
    uint32_t maxSum = 0u;
    uint32_t maxDiff = 0u;
    uint32_t maxIndex = CY_CAPSENSE_NO_LOCAL_MAX;
    uint32_t threshold = ptrWdConfig->ptrWdContext->fingerTh;
    int32_t numerator = 0;
    int32_t denominator = 0;
    uint32_t multiplier;
    uint32_t offset;
    
