RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_centroid.c
    threshold -= ptrWdConfig->ptrWdContext->hysteresis;
    ptrDpxTable = ptrWdConfig->ptrDiplexTable;
    
    /* Find maximum signal */
    ptrSnsCxt = ptrWdConfig->ptrSnsContext;
    for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
    {
        if (maxDiff < ptrSnsCxt->diff)
        {
            maxDiff = ptrSnsCxt->diff;
        }
        ptrSnsCxt++;
    }

    /* Find sensor index with maximum sum ([i-1],[i],[i+1]) including diplex part */
    ptrSnsCxt = ptrWdConfig->ptrSnsContext;
    for (snsIndex = 0u; snsIndex < (snsCount << 1u); snsIndex++)
    {
        /* Potential maximum */
        if (maxDiff == ptrSnsCxt[ptrDpxTable[snsIndex]].diff)
        {
            /* Get sum of differences around maximum */
            diffM = (snsIndex > 0u) ? ptrSnsCxt[ptrDpxTable[snsIndex - 1u]].diff : 0u;
            diffP = (snsIndex < ((snsCount << 1u) - 1u)) ? ptrSnsCxt[ptrDpxTable[snsIndex + 1u]].diff : 0u;
            sum = ptrSnsCxt[ptrDpxTable[snsIndex]].diff + diffM + diffP;
            if ((diffM < threshold) && (diffP < threshold))
            {
                sum = 0u;
            }
            if (maxSum < sum)
            {
                /* New maximum */
                maxIndex = snsIndex;
                maxSum = sum;
                numerator = (int32_t)diffP - (int32_t)diffM;
            }
        }
    }
    
    if ((maxIndex != CY_CAPSENSE_NO_LOCAL_MAX) && (maxSum > 0u))
    {
        multiplier = (uint32_t)ptrWdConfig->xResolution << 8u;
        /* Calculate position */
        if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CALC_METHOD_MASK))
        {
            multiplier /= ((snsCount << 1u) - 1u);
            offset = 0u;
        }
        else
        {
            multiplier /= (snsCount << 1u);
            offset = multiplier >> 1u;
        }
        
        denominator = (int32_t)maxSum;
        denominator = ((numerator * (int32_t)multiplier) / denominator) + (((int32_t)maxIndex * (int32_t)multiplier) + (int32_t)offset);
                    
        /* Round result and shift 8 bits left */
        newTouch->numPosition = CY_CAPSENSE_POSITION_ONE;
        newTouch->ptrPosition[0u].x = (uint16_t)(((uint32_t)denominator + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
    }
    else
    {
        newTouch->numPosition = CY_CAPSENSE_POSITION_NONE;
    }
}
#endif /*((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_DIPLEX_SLIDER_EN) ||\
          (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_DIPLEX_SLIDER_EN)) */


#if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_LINEAR_SLIDER_EN) ||\
    (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_LINEAR_SLIDER_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_DpCentroidLinear
****************************************************************************//**
*
* Finds touch position of a Linear slider widget.
*
* In scope of position searching this function finds the local maximum with the
* highest raw count. If such maximums are more than one, then the maximum with 
* bigger sum of neighboring sensors is taken for further processing. Then the position
* is calculated using centroid algorithm with three sensors.
*
* This function does not detect two or more touches.
* 
* \param newTouch
* The pointer to the touch structure where the found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpCentroidLinear(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t snsIndex = 0u;
    uint32_t snsCount = ptrWdConfig->numSns;

    uint32_t diffM;
    uint32_t diffP;
    uint32_t sum = 0u;
    uint32_t maxSum = 0u;
    uint32_t maxDiff = 0u;
    uint32_t maxIndex = CY_CAPSENSE_NO_LOCAL_MAX;
    const cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    int32_t numerator = 0;
    int32_t denominator = 0;
    uint32_t multiplier;
    uint32_t offset;

    if(snsCount < CY_CAPSENSE_LINEAR_SLIDER_MIN_SNS_COUNT)
    {
        snsCount = CY_CAPSENSE_LINEAR_SLIDER_MIN_SNS_COUNT;
    }

    if (1u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CENTROID_NUMBER_MASK))
    {
        /* Find maximum signal */
        ptrSnsCxt = ptrWdConfig->ptrSnsContext;
        for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
        {
            if (ptrSnsCxt->diff > maxDiff)
            {
                maxDiff = ptrSnsCxt->diff;
            }
            ptrSnsCxt++;
        }
        
        /* Find index of sensor with maximum signal */
        ptrSnsCxt = ptrWdConfig->ptrSnsContext;
        for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
        {
            /* Potential maximum */
            if (maxDiff == ptrSnsCxt->diff)
            {
                /* Get sum of differences around maximum */
                diffM = (snsIndex > 0u) ? (ptrSnsCxt - 1u)->diff : 0u;
                diffP = (snsIndex < (snsCount - 1u)) ? (ptrSnsCxt + 1u)->diff : 0u;
                sum = ptrSnsCxt->diff + diffM + diffP;
                if (maxSum < sum)
                {
                    /* New maximum */
                    maxIndex = snsIndex;
                    maxSum = sum;
                    numerator = (int32_t)diffP - (int32_t)diffM;
                }
            }
            ptrSnsCxt++;
        }
        
        if ((maxIndex != CY_CAPSENSE_NO_LOCAL_MAX) && (maxSum > 0u))
        {   
            /* Calculate position */
            multiplier = (uint32_t)ptrWdConfig->xResolution << 8u;
            if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CALC_METHOD_MASK))
            {
                multiplier /= (snsCount - 1u);
                offset = 0u;
            }
            else
            {
                multiplier /= snsCount;
                offset = multiplier >> 1u;
            }
            
            denominator = (int32_t)maxSum;
            denominator = ((numerator * (int32_t)multiplier) / denominator) + (((int32_t)maxIndex * (int32_t)multiplier) + (int32_t)offset);     

            /* Round result and shift 8 bits left */
            newTouch->numPosition = CY_CAPSENSE_POSITION_ONE;
            newTouch->ptrPosition[0u].x = (uint16_t)(((uint32_t)denominator + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
        }
        else
        {
            newTouch->numPosition = CY_CAPSENSE_POSITION_NONE;
        }
    }
    else
    {
        /* This is a place holder for local maximum searching when number of centroids could be more than one */
    }
}
#endif /* ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_LINEAR_SLIDER_EN) ||\
           (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_LINEAR_SLIDER_EN)) */


#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_RADIAL_SLIDER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpCentroidRadial
****************************************************************************//**
*
* Finds touch position of a Radial slider widget.
*
* In scope of position searching this function finds the local maximum with the
* highest raw count. If such maximums are more than one, then the maximum with 
* bigger sum of neighboring sensors is taken for further processing. Then the position
* is calculated using centroid algorithm with three sensors.
*
* This function does not detect two or more touches.
* 
* \param newTouch
* The pointer to the touch structure where found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpCentroidRadial(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t snsIndex = 0u;
    uint32_t snsCount = ptrWdConfig->numSns;
    
