RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_centroid.c
        /* Prepare 3x3 centroid two dimensional array */
        /* Fill each row */
        for (i = 0u; i < CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_LENGTH; i++)
        {
            /* 
            * The first  condition could be valid only when local max on the first row (0 row) of Touchpad
            * The second condition could be valid only when local max on the last row of Touchpad
            * Then corresponding row (zero or the last) of 3x3 array is initialized to 0u 
            */
            if (((((int32_t)ptrNewPeak->x - 1) + (int32_t)i) < 0) ||
                ((((int32_t)ptrNewPeak->x - 1) + (int32_t)i) > (int32_t)lastRx))
            {
                centroid[CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_PREVIOUS][i] = 0u;
                centroid[CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_CENTER][i] = 0u;
                centroid[CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_NEXT][i] = 0u;
            }
            else
            {
                /* Fill each column */
                for (j = 0u; j < CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_LENGTH; j++)
                {
                    /* 
                    * The first condition could be valid only when local max 
                    * on the first column (0 row) of Touchpad. The second 
                    * condition could be valid only when local max on the last 
                    * column of Touchpad. Then corresponding column (zero or 
                    * the last) of 3x3 array is initialized to 0u.
                    */
                    if (((((int32_t)ptrNewPeak->y - 1) + (int32_t)j) < 0) ||
                        ((((int32_t)ptrNewPeak->y - 1) + (int32_t)j) > (int32_t)lastTx))
                    {
                        centroid[j][i] = 0u;
                    }
                    else
                    {
                        centroid[j][i] = (uint16_t)(ptrSnsCxt + (((i - 1u) * ptrWdConfig->numRows) + (j - 1u)))->diff; //MISRA?
                    }
                }
            }
        }

        weightedSumX = 0;
        weightedSumY = 0;
        totalSum = 0u;

        /* Calculate centroid */
        for (i = 0u; i < CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_LENGTH; i++)
        {
            for (j = 0u; j < CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_LENGTH; j++)
            {
                totalSum += centroid[i][j];
                weightedSumX += (int32_t)centroid[i][j] * ((int32_t)j - 1);
                weightedSumY += (int32_t)centroid[i][j] * ((int32_t)i - 1);
            }
        }

        /* The X position is calculated.
        * The weightedSumX value depends on a finger position shifted regarding 
        * the X electrode (ptrNewTouches.x).
        * The multiplier ptrWdConfig->xCentroidMultiplier is a short from:
        * CY_CAPSENSE_TOUCHPAD0_X_RESOLUTION * 256u) / (CY_CAPSENSE_TOUCHPAD0_NUM_RX - CONFIG))
        * where CONFIG = 0 or 1 depends on TouchpadMultiplerMethod parameter.
        */
        /* Calculate position */
        multiplierX = (uint32_t)ptrWdConfig->xResolution << 8u;
        multiplierY = (uint32_t)ptrWdConfig->yResolution << 8u;
        if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CALC_METHOD_MASK))
        {
            multiplierX /= lastRx;
            offsetX = 0u;
            multiplierY /= lastTx;
            offsetY = 0u;
        }
        else
        {
            multiplierX /= (lastRx + 1u);
            offsetX = multiplierX >> 1u;
            multiplierY /= (lastTx + 1u);
            offsetY = multiplierY >> 1u;
        }

        weightedSumX = ((weightedSumX * (int32_t)multiplierX) / (int32_t)totalSum) +
                        ((((int32_t)ptrNewPeak->x) * (int32_t)multiplierX) + (int32_t)offsetX);

        /* The X position is rounded to the nearest integer value and normalized to the resolution range */
        ptrNewPeak->x = (uint16_t)(((uint32_t)weightedSumX + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
        /* The Y position is calculated.
        * The weightedSumY value depends on a finger position shifted regarding the Y electrode (ptrWdConfig->ptrNewTouches.y)
        * The multiplier ptrWdConfig->yCentroidMultiplier is a short from:
        * CY_CAPSENSE_TOUCHPAD0_Y_RESOLUTION * 256u) / (CY_CAPSENSE_TOUCHPAD0_NUM_TX - CONFIG))
        * where CONFIG = 0 or 1 depends on TouchpadMultiplerMethod parameter
        */
        weightedSumY = ((weightedSumY * (int32_t)multiplierY) / (int32_t)totalSum) +
                        ((((int32_t)ptrNewPeak->y) * (int32_t)multiplierY) + (int32_t)offsetY);

        /* The Y position is rounded to the nearest integer value and normalized to the resolution range */
        ptrNewPeak->y = (uint16_t)(((uint32_t)weightedSumY + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);

        /* The z value is a sum of raw counts of sensors that form 3x3 matrix with a local maximum in the center */
        ptrNewPeak->z = (uint8_t)(totalSum >> CY_CAPSENSE_CSX_TOUCHPAD_Z_SHIFT);
        ptrNewPeak++;
    }
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN) */


#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpTouchTracking
****************************************************************************//**
*
* Tracks touches.
*
* This function tracks the found touches:
* - associates them with previous touches applying the Hungarian algorithm.
* - applies debounce filters.
* - suppresses excessive touches.
*
* The final touch data are stored in the CSX buffer ptrCsxTouchBuffer 
* \ref cy_stc_capsense_csx_touch_buffer_t. This function should be called 
* each scan cycle even when touch is not detected.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
void Cy_CapSense_DpTouchTracking(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t i;
    
    const cy_stc_capsense_position_t * ptrNewPeak;
    cy_stc_capsense_position_t * ptrOldPeak;
        
    uint32_t newTouchNum = ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber;
    uint32_t oldTouchNum = ptrWdConfig->ptrCsxTouchHistory->oldPeakNumber;

    int8_t * fingerPosIndex = &ptrWdConfig->ptrCsxTouchBuffer->fingerPosIndexMap[0u];
    
    if ((0u != newTouchNum) || (0u != oldTouchNum))
    {
        /* Initialize variables */
        ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask = 0u;
        /* Getting active touch IDs from previous scan */
        ptrWdConfig->ptrCsxTouchHistory->oldActiveIdsMask = 0u;
        
        ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[0u];
        for (i = 0u; i < oldTouchNum; i++)
        {
            ptrWdConfig->ptrCsxTouchHistory->oldActiveIdsMask |= (uint8_t)(1u << ptrOldPeak->id);
            ptrOldPeak++;
        }

        if (0u < newTouchNum)
        {
            if (0u == oldTouchNum)
            {
                /* If the previous touch tracking had not any touches */
                for (i = 0u; i < newTouchNum; i++)
                {
                    /* Initializes a new touch, set ID to next value and Age to 0 */
                    Cy_CapSense_NewTouch(i, ptrWdConfig);
                }
            }
            else
            {
                /* Don't call Hungarian for 1 current and 1 previous touch */
                fingerPosIndex[0u] = 0;
                if ((1u != newTouchNum) || (1u != oldTouchNum))
                {
                    Cy_CapSense_Hungarian(ptrWdConfig);
                }
                /* General case */
                if (newTouchNum >= oldTouchNum)
                {
                    ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[0u];
                    for (i = 0u; i < oldTouchNum; i++)
                    {
                        if (ptrWdConfig->ptrCsxTouchHistory->velocity < Cy_CapSense_CalcDistance((uint32_t)fingerPosIndex[i], i, ptrWdConfig))
                        {
                            /* Set new ID and reset Age */
                            Cy_CapSense_NewTouch((uint32_t)fingerPosIndex[i], ptrWdConfig);
                        }
                        else
                        {
                            /* Set ID to previous value and increase Age */
                            ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask |= (uint8_t)(1u << (ptrOldPeak->id));
                            Cy_CapSense_TransferTouch((uint32_t)fingerPosIndex[i], i, ptrWdConfig);
                        }
                        ptrOldPeak++;
                    }
                }
                else
                {
                    ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[0u];
                    for (i = 0u; i < newTouchNum; i++)
                    {
                        if (ptrWdConfig->ptrCsxTouchHistory->velocity < Cy_CapSense_CalcDistance(i, (uint32_t)fingerPosIndex[i], ptrWdConfig))
                        {
                            /* Set new ID and reset Age. */
                            Cy_CapSense_NewTouch(i, ptrWdConfig);
                        }
                        else
                        {
                            /* Set ID to previous value and increase Age. */
                            ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask |= (uint8_t)(1u << (ptrOldPeak->id));
                            Cy_CapSense_TransferTouch(i, (uint32_t)fingerPosIndex[i], ptrWdConfig);
                        }
                        ptrOldPeak++;
                    }
                }
                /* Added new fingers, they need to assign ID */
                if (newTouchNum > oldTouchNum)
                {
                    /* Search new fingers */
                    ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];
                    for (i = 0u; i < newTouchNum; i++)
                    {
                        /* New finger found */
                        if (0u != (ptrNewPeak->id & CY_CAPSENSE_CSX_TOUCHPAD_ID_UNDEFINED))
                        {
                            Cy_CapSense_NewTouch(i, ptrWdConfig);
                        }
                        ptrNewPeak++;
                    }
                }
            }

