RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_centroid.c
    /* Return an indicator of failure */
    return (uint8_t)(touchId);
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN) */


#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_TouchDownDebounce
****************************************************************************//**
*
* Handles touchdown debouncing.
*
* Even if a new touch is detected, it is not considered as active until the
* debounce counter has not reached zero. If the debounce counter has reached zero,
* the touchdown mask is cleared. Otherwise the age of the new finger is cleared
* (it is considered as not active).
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CapSense_TouchDownDebounce(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t i;
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];

    for (i = 0u; i < ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber; i++)
    {
        /* If it is a touchdown debouncing finger its age is set to zero */
        if (0u != (ptrNewPeak->id & CY_CAPSENSE_CSX_TOUCHPAD_DEBOUNCE_MASK))
        {
            /* Set the age to zero - finger is not active */
            ptrNewPeak->z &= (uint16_t)~CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK;
        }
        ptrNewPeak++;
    }
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN) */


#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CalcDistance
****************************************************************************//**
*
* Calculates squared distance between history and active touch structures 
* pointed by the input parameters.
*
* \param newIndex      
* The index of touch in the active touch structure.
*
* \param oldIndex      
* The index of touch in the history touch structure.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
* \return 
* Returns the squared distance.
*
*******************************************************************************/
static uint32_t Cy_CapSense_CalcDistance(
                uint32_t newIndex, 
                uint32_t oldIndex,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    const cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[newIndex];
    const cy_stc_capsense_position_t * ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[oldIndex];
    
    int32_t xDistance = (int32_t)(ptrOldPeak->x) - (int32_t)(ptrNewPeak->x);
    int32_t yDistance = (int32_t)(ptrOldPeak->y) - (int32_t)(ptrNewPeak->y);
    
    xDistance *= xDistance;
    yDistance *= yDistance;
    
    return ((uint32_t)xDistance + (uint32_t)yDistance);
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN) */


#if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_Hungarian
****************************************************************************//**
*
* Executes the Hungarian method on a distance map to track motion of two 
* touch sets (old touches vs new touches).
*
* This function uses the Hungarian method described in specification 001-63362.
* There is no bound checking on the parameters. It is the calling function's
* responsibility to ensure parameter validity.
* The function output is a fingerPosIndexMap array stored in the CSX buffer 
* where associations between the previous and current touches are returned.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
* 
*******************************************************************************/
static void Cy_CapSense_Hungarian(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    cy_stc_capsense_csx_touch_buffer_t * ptrBuffer = ptrWdConfig->ptrCsxTouchBuffer;
    /*
    * Number of elements in column of distanceMap matrix. This value must
    * be greater than or equal to 1.
    */
    int32_t * col = &ptrBuffer->colMap[0u];
    /* 
    * Number of elements in row of distanceMap matrix. This value must be
    * greater than or equal to colCount. 
    */
    int32_t * row = &ptrBuffer->rowMap[0u];
    int32_t * mins = &ptrBuffer->minsMap[0u];
    int8_t * links = &ptrBuffer->linksMap[0u];
    int8_t * visited = &ptrBuffer->visitedMap[0u];
    int8_t * markIndices = &ptrBuffer->markIndicesMap[0u];
    /*
    * The 2-dimensional map of distances between the nodes in each
    * coordinate set. The 1st index of distanceMap corresponds to nodes
    * in the 1st coordinate data set, and the 2nd index of distanceMap
    * corresponds to the 2nd coordinate data set. Each element in
    * distanceMap is the square of the distance between the
    * corresponding coordinates in the 1st and 2nd data set.
    */    
    int32_t * distance = &ptrBuffer->distanceMap[0u];
    
    int32_t delta = 0;
    int32_t colValue = 0;
    int32_t markedI = 0;
    int32_t markedJ = 0;
    int32_t i = 0;
    int32_t iIndex = 0;
    int32_t j = 0;
    int32_t jIndex = 0;

    uint32_t rowCount = ptrBuffer->newPeakNumber;
    uint32_t colCount = ptrWdConfig->ptrCsxTouchHistory->oldPeakNumber;
    
    /* Fill distance map */
    if (rowCount >= colCount)
    {
        for (i = (int32_t)rowCount; i-- > 0; )
        {
            for (j = (int32_t)colCount; j-- > 0; )
            {
                distance[((uint32_t)i * CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS) + (uint32_t)j] = (int32_t)Cy_CapSense_CalcDistance((uint32_t)i, (uint32_t)j, ptrWdConfig);
            }
        }
    }
    else
    {
        for (i = (int32_t)colCount; i-- > 0;)
        {
            for (j = (int32_t)rowCount; j-- > 0;)
            {
                distance[((uint32_t)i * CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS) + (uint32_t)j] = (int32_t)Cy_CapSense_CalcDistance((uint32_t)j, (uint32_t)i, ptrWdConfig);
            }
        }
        colValue = (int32_t)colCount;
        colCount = rowCount;
        rowCount = (uint32_t)colValue;
    }

    (void)memset(col, 0, (uint32_t)colCount * 4u);

    /* Initialize row and markIndices arrays */
    for (i = (int32_t)rowCount; i-- > 0;)
    {
        row[i] = 0;
        markIndices[i] = -1;
    }
    
    /* Go through all columns */
    for (i = (int32_t)colCount; i-- > 0;)
    {
        /* Initialize visited, links, mins arrays. They are used for every column */
        for (iIndex = (int32_t)rowCount; iIndex-- > 0;)
        {
            visited[iIndex] = 0;
            links[iIndex] = -1;
            mins[iIndex] = INT32_MAX;
        }

