RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_centroid.c
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POS_JITTER_FILTER_EN)
        if (0u != (filterCfg & CY_CAPSENSE_POSITION_JIT_MASK))
        {
            /* Perform zero-cross correction */
            if (ptrHistoryIndex->x > (halfResolution + xPos))
            {
                xPos += centroidResolution;
            }
            if (xPos > (halfResolution + ptrHistoryIndex->x))
            {
                ptrHistoryIndex->x += (uint16_t)centroidResolution;
            }
            /* Perform filtering */
            xPos = Cy_CapSense_FtJitter(xPos, (uint32_t)ptrHistoryIndex->x);
            /* Perform zero-cross correction of filtered position */
            if (xPos >= centroidResolution)
            {
                xPos -= centroidResolution;
            }
            ptrHistoryIndex->x = (uint16_t)xPos;
        }
    #endif

    ptrInput->x = (uint16_t)xPos;
}
#endif /*(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_POSITION_FILTER_EN)*/

/*******************************************************************************
* Function Name: Cy_CapSense_ProcessPositionFilters
****************************************************************************//**
*
* Performs filtering of touch positions applying enabled filters.
*
* \param newTouch
* The pointer to the touch structure.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
void Cy_CapSense_ProcessPositionFilters(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t posIndex;
    uint32_t filterCfg;
    uint32_t numPosMin;
    uint32_t filterSize;
    cy_stc_capsense_position_t * ptrHistory;
    cy_stc_capsense_position_t * ptrPos;
    uint32_t numPos = newTouch->numPosition;

    /* Position filtering */
    if ((CY_CAPSENSE_POSITION_NONE != numPos) && (CY_CAPSENSE_POSITION_MULTIPLE != numPos))
    {
        filterCfg = ptrWdConfig->posFilterConfig;
        numPosMin = ptrWdConfig->ptrPosFilterHistory->numPosition;
        ptrPos = newTouch->ptrPosition;
        ptrHistory = ptrWdConfig->ptrPosFilterHistory->ptrPosition;
        filterSize = (filterCfg & CY_CAPSENSE_POSITION_FILTERS_SIZE_MASK) >> CY_CAPSENSE_POSITION_FILTERS_SIZE_OFFSET;

        /* The same actions should be done for cases with no touches or multiple touches */
        if (CY_CAPSENSE_POSITION_MULTIPLE == numPosMin)
        {
            numPosMin = CY_CAPSENSE_POSITION_NONE;
        }

        /* Find number of position that exists from previous processing */
        if (numPosMin > numPos)
        {
            numPosMin = numPos;
        }

        /* Process touches that exists from previous processing */
        #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_RADIAL_SLIDER_EN) &&\
            (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_POSITION_FILTER_EN))
            if((uint8_t)CY_CAPSENSE_WD_RADIAL_SLIDER_E == ptrWdConfig->wdType)
            {
                for (posIndex = 0u; posIndex < numPosMin; posIndex++)
                {
                    Cy_CapSense_RunPositionFiltersRadial(ptrWdConfig, ptrPos, ptrHistory);
                    ptrPos++;
                    ptrHistory += filterSize;
                }
            }
            else
            {
                for (posIndex = 0u; posIndex < numPosMin; posIndex++)
                {
                    Cy_CapSense_RunPositionFilters(ptrWdConfig, ptrPos, ptrHistory);
                    ptrPos++;
                    ptrHistory += filterSize;
                }
            }
        #else
            for (posIndex = 0u; posIndex < numPosMin; posIndex++)
            {
                Cy_CapSense_RunPositionFilters(ptrWdConfig, ptrPos, ptrHistory);
                ptrPos++;
                ptrHistory += filterSize;
            }
        #endif
        /* Initialize all rest newly detected touches */
        for (; posIndex < numPos; posIndex++)
        {
            Cy_CapSense_InitPositionFilters(filterCfg, ptrPos, ptrHistory);
            ptrPos++;
            ptrHistory += filterSize;
        }
    }
    /* Finally, copy number of positions */
    ptrWdConfig->ptrPosFilterHistory->numPosition = (uint8_t)numPos;
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POSITION_FILTER_EN) */
#endif /* ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_SLIDER_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_TOUCHPAD_EN)) */
#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3)) */

/* [] END OF FILE */
